cf_billing/Documents/энргИзменитьДиаметрСеченияТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменитьДиаметрСеченияТочекУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргДиаметрСеченияТочекУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РассчитыватьПоДиаметруСечения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДиаметрСечения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргДиаметрСеченияТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДиаметрСеченияТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиаметрСечения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргИзменитьДиаметрСеченияТочекУчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьРеквизитыФормы();
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьРеквизитыФормы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.Организация		= Неопределено;
		Объект.Район			= Неопределено;
		Объект.КлючПомещения	= Неопределено;
		ЭтаФорма.Помещение 		= Неопределено;
		ЭтаФорма.Строение 		= Неопределено;
	КонецЕсли;
	ОбновитьТЧ();
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ТочкиУчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#Область ОбработчикиКомандФормы
// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Заполнить(Команда)
	ОбновитьТЧ();
КонецПроцедуры
#КонецОбласти

#Область ДополнительныеФункции
&НаКлиенте
Процедура ОбновитьРеквизитыФормы()
	ИменаРекформы = Новый Структура("Строение, Помещение");
	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент, ИменаРекформы);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ИменаРекформы);
	ОбновитьТЧ(Ложь);
КонецПроцедуры

&НаСервере
Процедура ОбновитьТЧ(ИзменятьСтроки = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАктивностьТочекУчетаСрезПоследних.Организация КАК Организация,
		|	энргАктивностьТочекУчетаСрезПоследних.Район КАК Район,
		|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние КАК Состояние
		|ПОМЕСТИТЬ ВТ_ТочкиУчета
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|			&ГраницаРасчета,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргАктивностьТочекУчетаСрезПоследних
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргДиаметрСеченияТочекУчетаСрезПоследних.Использовать КАК ПредыдущийРассчитыватьПоДиаметруСечения,
		|	энргДиаметрСеченияТочекУчетаСрезПоследних.ДиаметрСечения КАК ПредыдущийДиаметрСечения,
		|	ВТ_ТочкиУчета.ТочкаУчета КАК ТочкаУчета
		|ИЗ
		|	ВТ_ТочкиУчета КАК ВТ_ТочкиУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргДиаметрСеченияТочекУчета.СрезПоследних(
		|				&ГраницаРасчета,
		|				(Организация, Район, КлючПомещения, ТочкаУчета) В
		|					(ВЫБРАТЬ
		|						ВТ_ТочкиУчета.Организация КАК Организация,
		|						ВТ_ТочкиУчета.Район КАК Район,
		|						ВТ_ТочкиУчета.КлючПомещения КАК КлючПомещения,
		|						ВТ_ТочкиУчета.ТочкаУчета КАК ТочкаУчета
		|					ИЗ
		|						ВТ_ТочкиУчета КАК ВТ_ТочкиУчета)) КАК энргДиаметрСеченияТочекУчетаСрезПоследних
		|		ПО ВТ_ТочкиУчета.Организация = энргДиаметрСеченияТочекУчетаСрезПоследних.Организация
		|			И ВТ_ТочкиУчета.Район = энргДиаметрСеченияТочекУчетаСрезПоследних.Район
		|			И ВТ_ТочкиУчета.КлючПомещения = энргДиаметрСеченияТочекУчетаСрезПоследних.КлючПомещения
		|			И ВТ_ТочкиУчета.ТочкаУчета = энргДиаметрСеченияТочекУчетаСрезПоследних.ТочкаУчета";
	
	
	Запрос.УстановитьПараметр("ГраницаРасчета", Новый Граница(Объект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("КлючПомещения",  Объект.КлючПомещения);
	Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	Запрос.УстановитьПараметр("Район",			Объект.Район);
	
	СписокНайденыхТУ = Новый Массив;
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("ТочкаУчета", Выборка.ТочкаУчета);
		
		СтрокиТЧ = Объект.ТочкиУчета.НайтиСтроки(Отбор);
		СписокНайденыхТУ.Добавить(Выборка.ТочкаУчета);
		Если СтрокиТЧ.Количество() = 0 Тогда
			Если ИзменятьСтроки Тогда
				Модифицированность = Истина;
				
				НовСтрокаТЧ = Объект.ТочкиУчета.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, Выборка);
				НовСтрокаТЧ.РассчитыватьПоДиаметруСечения = Выборка.ПредыдущийРассчитыватьПоДиаметруСечения;
				НовСтрокаТЧ.ДиаметрСечения				  = Выборка.ПредыдущийДиаметрСечения;
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокиТЧ[0], Выборка);
		КонецЕсли;
	КонецЦикла;
	
	Если ИзменятьСтроки Тогда
		МассивСтрокУдалить = Новый Массив;
		
		Для каждого СтрокаТЧ Из Объект.ТочкиУчета Цикл
			Если СписокНайденыхТУ.Найти(СтрокаТЧ.ТочкаУчета) = Неопределено Тогда 
				МассивСтрокУдалить.Добавить(СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаТЧ Из МассивСтрокУдалить Цикл
			Модифицированность = Истина;
			Объект.ТочкиУчета.Удалить(СтрокаТЧ);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
